app/services/search_api_service.rb

  def create_tweets(params)
    @parsed_resp["statuses"].each do |tw|

      puts "Hashtag:", @query
      puts "User name:", tw["user"]["name"]
      puts "Mensagem:", tw["text"]
      puts

      @tweet = params.tweets.new(
        tweet_desc: tw["text"],
        date_post: tw["created_at"],
        user_name: tw["user"]["name"],
        user_screen_name: tw["user"]["screen_name"],
        url_img_user: tw["user"]["profile_image_url"]
      ).save
---
INSERT INTO "tweets" ("hashtag_id", "tweet_desc", "date_post", "created_at", "updated_at", "user_name", "user_screen_name", "url_img_user") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"