app/views/hashtags/show.html.erb


  <% Tweet.where(hashtag_id: @hashtag.id).each do | tw | %>
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."hashtag_id" = $1  [["hashtag_id", 2]]