app/views/list_tweets/index.html.erb


    <% Tweet.all.each do | tw | %>
---
SELECT "tweets".* FROM "tweets"