app/controllers/hashtags_controller.rb

  def index
    @hashtags = Hashtag.all
---
SELECT "hashtags".* FROM "hashtags"

  def show
    @hashtag = Hashtag.find(params[:id])
---
SELECT  "hashtags".* FROM "hashtags" WHERE "hashtags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @hashtag = Hashtag.new(hashtag_params)

    if @hashtag.tag[0] != '#'
      @hashtag.tag = '#' + @hashtag.tag
    end

    if @hashtag.tag.match(/\S\s+/)
      @hashtag.tag = @hashtag.tag.strip
    end

    @hashtag.save

    # Using the SearchApiService
    search = SearchApiService.new(@hashtag)

    if search.search_api
      search.create_tweets(@hashtag)
---
INSERT INTO "hashtags" ("tag", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["tag", "#software development"], ["created_at", "2020-01-10 19:43:43.270468"], ["updated_at", "2020-01-10 19:43:43.270468"]]
INSERT INTO "tweets" ("hashtag_id", "tweet_desc", "date_post", "created_at", "updated_at", "user_name", "user_screen_name", "url_img_user") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @hashtag = Hashtag.find(params[:id])

    Tweet.where(hashtag_id: @hashtag.id).destroy_all

    # Using the SearchApiService
    search = SearchApiService.new(@hashtag)

    if search.search_api
      search.create_tweets(@hashtag)
---
SELECT  "hashtags".* FROM "hashtags" WHERE "hashtags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "hashtags" WHERE "hashtags"."id" = $1  [["id", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 16]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."hashtag_id" = $1  [["hashtag_id", 2]]
INSERT INTO "tweets" ("hashtag_id", "tweet_desc", "date_post", "created_at", "updated_at", "user_name", "user_screen_name", "url_img_user") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @hashtag = Hashtag.find(params[:id])
    @hashtag.destroy
---
SELECT  "hashtags".* FROM "hashtags" WHERE "hashtags"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "hashtags" WHERE "hashtags"."id" = $1  [["id", 7]]