app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" ASC
---
  def index
    @tweets = Tweet.order :created_at

INSERT INTO "tweets" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-01-07 12:56:45.327856"], ["updated_at", "2020-01-07 12:56:45.327856"]]
---
  def search
    query = params["hashtag"]

    base_api_url = "https://api.twitter.com/1.1/search/tweets.json"
    auth = "Bearer AAAAAAAAAAAAAAAAAAAAAOsABgEAAAAAtUA16lT7ybdFpBpamME9Dp7L4X4%3DioSiudZDIQjkRZuRor1O68dI8y7RvZTrhBlHSciNea9lOODsWH"

    url = base_api_url + "?q=%23" + query[1..query.length]

    puts url
    puts

    resp = RestClient.get(url, {accept: :json, authorization: auth})

    parsed_resp = JSON.parse(resp)

    parsed_resp["statuses"].each do |tw|


      @tweet = Tweet.new(
        hashtag: query,
        i_tweet: tw["id_str"],
        tweet_desc: tw["text"],
        date_post: tw["created_at"],
        user_name: tw["user"]["name"],
        user_screen_name: tw["user"]["screen_name"],
        url_img_user: tw["user"]["profile_image_url"]
      ).save

INSERT INTO "tweets" ("hashtag", "i_tweet", "tweet_desc", "date_post", "created_at", "updated_at", "user_name", "user_screen_name", "url_img_user") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save