app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-12-31 12:32:16.121236"], ["updated_at", "2019-12-31 12:32:16.121236"]]

    def set_tweet
      @tweet = Tweet.find(params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."tweet_id" = ? LIMIT ?  [["tweet_id", "index"], ["LIMIT", 1]]